/* automatically generated by rust-bindgen 0.66.1 */

pub const __bool_true_false_are_defined: u32 = 1;
pub const true_: u32 = 1;
pub const false_: u32 = 0;
pub const SOAPY_SDR_TRUE: &[u8; 5] = b"true\0";
pub const SOAPY_SDR_FALSE: &[u8; 6] = b"false\0";
pub const SOAPY_SDR_TX: u32 = 0;
pub const SOAPY_SDR_RX: u32 = 1;
pub const SOAPY_SDR_END_BURST: u32 = 2;
pub const SOAPY_SDR_HAS_TIME: u32 = 4;
pub const SOAPY_SDR_END_ABRUPT: u32 = 8;
pub const SOAPY_SDR_ONE_PACKET: u32 = 16;
pub const SOAPY_SDR_MORE_FRAGMENTS: u32 = 32;
pub const SOAPY_SDR_WAIT_TRIGGER: u32 = 64;
pub const SOAPY_SDR_TIMEOUT: i32 = -1;
pub const SOAPY_SDR_STREAM_ERROR: i32 = -2;
pub const SOAPY_SDR_CORRUPTION: i32 = -3;
pub const SOAPY_SDR_OVERFLOW: i32 = -4;
pub const SOAPY_SDR_NOT_SUPPORTED: i32 = -5;
pub const SOAPY_SDR_TIME_ERROR: i32 = -6;
pub const SOAPY_SDR_UNDERFLOW: i32 = -7;
pub const SOAPY_SDR_CF64: &[u8; 5] = b"CF64\0";
pub const SOAPY_SDR_CF32: &[u8; 5] = b"CF32\0";
pub const SOAPY_SDR_CS32: &[u8; 5] = b"CS32\0";
pub const SOAPY_SDR_CU32: &[u8; 5] = b"CU32\0";
pub const SOAPY_SDR_CS16: &[u8; 5] = b"CS16\0";
pub const SOAPY_SDR_CU16: &[u8; 5] = b"CU16\0";
pub const SOAPY_SDR_CS12: &[u8; 5] = b"CS12\0";
pub const SOAPY_SDR_CU12: &[u8; 5] = b"CU12\0";
pub const SOAPY_SDR_CS8: &[u8; 4] = b"CS8\0";
pub const SOAPY_SDR_CU8: &[u8; 4] = b"CU8\0";
pub const SOAPY_SDR_CS4: &[u8; 4] = b"CS4\0";
pub const SOAPY_SDR_CU4: &[u8; 4] = b"CU4\0";
pub const SOAPY_SDR_F64: &[u8; 4] = b"F64\0";
pub const SOAPY_SDR_F32: &[u8; 4] = b"F32\0";
pub const SOAPY_SDR_S32: &[u8; 4] = b"S32\0";
pub const SOAPY_SDR_U32: &[u8; 4] = b"U32\0";
pub const SOAPY_SDR_S16: &[u8; 4] = b"S16\0";
pub const SOAPY_SDR_U16: &[u8; 4] = b"U16\0";
pub const SOAPY_SDR_S8: &[u8; 3] = b"S8\0";
pub const SOAPY_SDR_U8: &[u8; 3] = b"U8\0";
pub const SOAPY_SDR_API_VERSION: u32 = 524288;
pub const SOAPY_SDR_ABI_VERSION: &[u8; 4] = b"0.8\0";

#[doc = "! Definition for a min/max numeric range"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoapySDRRange {
    pub minimum: f64,
    pub maximum: f64,
    pub step: f64,
}
#[test]
fn bindgen_test_layout_SoapySDRRange() {
    const UNINIT: ::std::mem::MaybeUninit<SoapySDRRange> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SoapySDRRange>(),
        24usize,
        concat!("Size of: ", stringify!(SoapySDRRange))
    );
    assert_eq!(
        ::std::mem::align_of::<SoapySDRRange>(),
        8usize,
        concat!("Alignment of ", stringify!(SoapySDRRange))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).minimum) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRRange),
            "::",
            stringify!(minimum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).maximum) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRRange),
            "::",
            stringify!(maximum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRRange),
            "::",
            stringify!(step)
        )
    );
}
#[doc = "! Definition for a key/value string map"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoapySDRKwargs {
    pub size: usize,
    pub keys: *mut *mut ::std::os::raw::c_char,
    pub vals: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SoapySDRKwargs() {
    const UNINIT: ::std::mem::MaybeUninit<SoapySDRKwargs> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SoapySDRKwargs>(),
        24usize,
        concat!("Size of: ", stringify!(SoapySDRKwargs))
    );
    assert_eq!(
        ::std::mem::align_of::<SoapySDRKwargs>(),
        8usize,
        concat!("Alignment of ", stringify!(SoapySDRKwargs))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).size) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRKwargs),
            "::",
            stringify!(size)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).keys) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRKwargs),
            "::",
            stringify!(keys)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).vals) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRKwargs),
            "::",
            stringify!(vals)
        )
    );
}
extern "C" {
    #[doc = " Convert a markup string to a key-value map.\n The markup format is: \"key0=value0, key1=value1\""]
    pub fn SoapySDRKwargs_fromString(markup: *const ::std::os::raw::c_char) -> SoapySDRKwargs;
}
extern "C" {
    #[doc = " Convert a key-value map to a markup string.\n The markup format is: \"key0=value0, key1=value1\""]
    pub fn SoapySDRKwargs_toString(args: *const SoapySDRKwargs) -> *mut ::std::os::raw::c_char;
}
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_BOOL: SoapySDRArgInfoType = 0;
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_INT: SoapySDRArgInfoType = 1;
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_FLOAT: SoapySDRArgInfoType = 2;
pub const SoapySDRArgInfoType_SOAPY_SDR_ARG_INFO_STRING: SoapySDRArgInfoType = 3;
#[doc = "! Definition for argument info"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SoapySDRArgInfo {
    #[doc = "! The key used to identify the argument (required)"]
    pub key: *mut ::std::os::raw::c_char,
    #[doc = " The default value of the argument when not specified (required)\n Numbers should use standard floating point and integer formats.\n Boolean values should be represented as \"true\" and  \"false\"."]
    pub value: *mut ::std::os::raw::c_char,
    #[doc = "! The displayable name of the argument (optional, use key if empty)"]
    pub name: *mut ::std::os::raw::c_char,
    #[doc = "! A brief description about the argument (optional)"]
    pub description: *mut ::std::os::raw::c_char,
    #[doc = "! The units of the argument: dB, Hz, etc (optional)"]
    pub units: *mut ::std::os::raw::c_char,
    #[doc = "! The data type of the argument (required)"]
    pub type_: SoapySDRArgInfoType,
    #[doc = " The range of possible numeric values (optional)\n When specified, the argument should be restricted to this range.\n The range is only applicable to numeric argument types."]
    pub range: SoapySDRRange,
    #[doc = "! The size of the options set, or 0 when not used."]
    pub numOptions: usize,
    #[doc = " A discrete list of possible values (optional)\n When specified, the argument should be restricted to this options set."]
    pub options: *mut *mut ::std::os::raw::c_char,
    #[doc = " A discrete list of displayable names for the enumerated options (optional)\n When not specified, the option value itself can be used as a display name."]
    pub optionNames: *mut *mut ::std::os::raw::c_char,
}
#[test]
fn bindgen_test_layout_SoapySDRArgInfo() {
    const UNINIT: ::std::mem::MaybeUninit<SoapySDRArgInfo> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SoapySDRArgInfo>(),
        96usize,
        concat!("Size of: ", stringify!(SoapySDRArgInfo))
    );
    assert_eq!(
        ::std::mem::align_of::<SoapySDRArgInfo>(),
        8usize,
        concat!("Alignment of ", stringify!(SoapySDRArgInfo))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).key) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(key)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).value) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(value)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).name) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(name)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).description) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(description)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).units) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(units)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).range) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(range)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numOptions) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(numOptions)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).options) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(options)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).optionNames) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(SoapySDRArgInfo),
            "::",
            stringify!(optionNames)
        )
    );
}
extern "C" {
    #[doc = " Free a pointer allocated by SoapySDR.\n For most platforms this is a simple call around free()"]
    pub fn SoapySDR_free(ptr: *mut ::std::os::raw::c_void);
}
extern "C" {
    #[doc = " Clear the contents of a list of string\n Convenience call to deal with results that return a string list."]
    pub fn SoapySDRStrings_clear(elems: *mut *mut *mut ::std::os::raw::c_char, length: usize);
}
extern "C" {
    #[doc = " Set a key/value pair in a kwargs structure.\n \\post\n If the key exists, the existing entry will be modified;\n otherwise a new entry will be appended to args.\n On error, the elements of args will not be modified,\n and args is guaranteed to be in a good state.\n \\return 0 for success, otherwise allocation error"]
    pub fn SoapySDRKwargs_set(
        args: *mut SoapySDRKwargs,
